In [167]:
import pandas as pd
import numpy as np

In [171]:
lst =['A','B','C']
lst = np.array(lst)

In [172]:
pd.Series(lst,lst2)

a    A
b    B
c    C
dtype: object

In [173]:
lst2 = ['a','b','c']

In [174]:
pd.Series(data = lst,index=lst2)

a    A
b    B
c    C
dtype: object

In [175]:
d = {'a':'A','b':'B','c':'C'}

In [176]:
pd.Series(d)

a    A
b    B
c    C
dtype: object

In [177]:
s1 = pd.Series(fam,index =[1,2,3,4])

In [178]:
fam = ['raja','rajeshwari','dhivya','dinesh']

In [179]:
s1

1          raja
2    rajeshwari
3        dhivya
4        dinesh
dtype: object

In [180]:
s2 = pd.Series(gf)

In [181]:
gf = ['sow','sound','kamalu','kavushi']

In [182]:
s2

0        sow
1      sound
2     kamalu
3    kavushi
dtype: object

In [183]:
gf1 = pd.Series([1,2,3,4],index = ['sow','sound','kamalu','kavushi'])

In [184]:
gf1

sow        1
sound      2
kamalu     3
kavushi    4
dtype: int64

In [185]:
gf2 = pd.Series([1,2,4,5],index = ['sow','sumaiya','kamalu','kavushi'])

In [186]:
gf2

sow        1
sumaiya    2
kamalu     4
kavushi    5
dtype: int64

In [187]:
gf1+gf2

kamalu     7.0
kavushi    9.0
sound      NaN
sow        2.0
sumaiya    NaN
dtype: float64

In [188]:
from numpy.random import randn

In [189]:
df = pd.DataFrame(randn(5,5),index =('A','B','C', 'D', 'E'),columns = 'P Q R S T'.split())

In [190]:
df

          P         Q         R         S         T
A  0.047826  0.738725 -0.086715  1.853119 -1.099848
B -1.951131  0.434935  0.385069  1.224774  0.760540
C  1.459394  0.209174 -2.119063 -1.147909  0.626592
D  0.851073  0.414763  0.315969 -0.294147 -0.099007
E -1.451430  0.061544  0.581825 -0.902592 -0.218306

In [191]:
type(df['P'])

pandas.core.series.Series

In [192]:
df['P']

A    0.047826
B   -1.951131
C    1.459394
D    0.851073
E   -1.451430
Name: P, dtype: float64

In [193]:
df[['P','R']]

          P         R
A  0.047826 -0.086715
B -1.951131  0.385069
C  1.459394 -2.119063
D  0.851073  0.315969
E -1.451430  0.581825

In [194]:
type(df[['P','R']])

pandas.core.frame.DataFrame

In [195]:
df['U'] = df['P'] - df['Q']

In [196]:
df

          P         Q         R         S         T         U
A  0.047826  0.738725 -0.086715  1.853119 -1.099848 -0.690899
B -1.951131  0.434935  0.385069  1.224774  0.760540 -2.386066
C  1.459394  0.209174 -2.119063 -1.147909  0.626592  1.250220
D  0.851073  0.414763  0.315969 -0.294147 -0.099007  0.436310
E -1.451430  0.061544  0.581825 -0.902592 -0.218306 -1.512974

# axis =0 means to access a row
# axis =1 means to access a columns

## inplace : to give inplace confirmly drop (column or row)

In [197]:
df.drop('U',axis = 1,inplace = True)

In [198]:
df

          P         Q         R         S         T
A  0.047826  0.738725 -0.086715  1.853119 -1.099848
B -1.951131  0.434935  0.385069  1.224774  0.760540
C  1.459394  0.209174 -2.119063 -1.147909  0.626592
D  0.851073  0.414763  0.315969 -0.294147 -0.099007
E -1.451430  0.061544  0.581825 -0.902592 -0.218306

In [199]:
df.drop('C',axis = 0)

          P         Q         R         S         T
A  0.047826  0.738725 -0.086715  1.853119 -1.099848
B -1.951131  0.434935  0.385069  1.224774  0.760540
D  0.851073  0.414763  0.315969 -0.294147 -0.099007
E -1.451430  0.061544  0.581825 -0.902592 -0.218306

In [200]:
df

          P         Q         R         S         T
A  0.047826  0.738725 -0.086715  1.853119 -1.099848
B -1.951131  0.434935  0.385069  1.224774  0.760540
C  1.459394  0.209174 -2.119063 -1.147909  0.626592
D  0.851073  0.414763  0.315969 -0.294147 -0.099007
E -1.451430  0.061544  0.581825 -0.902592 -0.218306

# if u want use row means use loc eg:(df.loc['B'])

# if u want use index means use iloc eg:(df.iloc[1])

In [205]:
d = df.loc[[df[]'' == 'E']]

IndexError: Boolean index has wrong length: 1 instead of 5

In [47]:
df.loc['B']

P    0.863354
Q    0.739741
R   -2.090525
S   -0.230988
T   -1.449106
Name: B, dtype: float64

In [48]:
df.iloc[1]

P    0.863354
Q    0.739741
R   -2.090525
S   -0.230988
T   -1.449106
Name: B, dtype: float64

In [49]:
df.iloc[0:,:2]

          P         Q
A -0.394657 -0.341933
B  0.863354  0.739741
C  0.858418 -0.979273
D -1.758540 -0.640521
E  0.535287 -1.020185

In [52]:
df.iloc[0:,:1]

          P
A -0.394657
B  0.863354
C  0.858418
D -1.758540
E  0.535287

In [160]:
df.loc[['A','B'],['P','Q']]

          P         Q
A  1.958959  0.721595
B -0.075868  0.920785

# to find a less than 0 or greater than 0 value

In [161]:
df > 0

       P      Q      R      S      T
A   True   True  False   True   True
B  False   True  False   True   True
C   True  False   True  False  False
D  False   True  False  False  False
E  False   True  False   True  False

In [162]:
df

          P         Q         R         S         T
A  1.958959  0.721595 -0.603663  1.070223  2.723671
B -0.075868  0.920785 -0.145625  2.237944  0.125942
C  0.725753 -0.376627  1.318442 -1.097764 -0.907189
D -0.150835  0.487379 -0.626911 -1.414200 -0.973137
E -0.299412  0.857463 -1.548821  0.100303 -2.335719

In [54]:
df[df>0]

          P         Q         R         S         T
A       NaN       NaN  0.128516       NaN  0.403196
B  0.863354  0.739741       NaN       NaN       NaN
C  0.858418       NaN       NaN       NaN  0.691262
D       NaN       NaN       NaN       NaN  0.187600
E  0.535287       NaN  1.214594  1.075491  0.572385

In [55]:
df[df<0]

          P         Q         R         S         T
A -0.394657 -0.341933       NaN -1.353116       NaN
B       NaN       NaN -2.090525 -0.230988 -1.449106
C       NaN -0.979273 -0.171517 -0.995512       NaN
D -1.758540 -0.640521 -1.616071 -2.218288       NaN
E       NaN -1.020185       NaN       NaN       NaN

In [58]:
df[df['P']>0][['P','Q']]

          P         Q
B  0.863354  0.739741
C  0.858418 -0.979273
E  0.535287 -1.020185

In [61]:
df[(df['P']> 0) & df['R']>0][['P','R']]

          P         R
B  0.863354 -2.090525
C  0.858418 -0.171517
E  0.535287  1.214594

In [62]:
df

          P         Q         R         S         T
A -0.394657 -0.341933  0.128516 -1.353116  0.403196
B  0.863354  0.739741 -2.090525 -0.230988 -1.449106
C  0.858418 -0.979273 -0.171517 -0.995512  0.691262
D -1.758540 -0.640521 -1.616071 -2.218288  0.187600
E  0.535287 -1.020185  1.214594  1.075491  0.572385

# how to reset a index in dataset

In [63]:
df.reset_index()

  index         P         Q         R         S         T
0     A -0.394657 -0.341933  0.128516 -1.353116  0.403196
1     B  0.863354  0.739741 -2.090525 -0.230988 -1.449106
2     C  0.858418 -0.979273 -0.171517 -0.995512  0.691262
3     D -1.758540 -0.640521 -1.616071 -2.218288  0.187600
4     E  0.535287 -1.020185  1.214594  1.075491  0.572385

In [64]:
df

          P         Q         R         S         T
A -0.394657 -0.341933  0.128516 -1.353116  0.403196
B  0.863354  0.739741 -2.090525 -0.230988 -1.449106
C  0.858418 -0.979273 -0.171517 -0.995512  0.691262
D -1.758540 -0.640521 -1.616071 -2.218288  0.187600
E  0.535287 -1.020185  1.214594  1.075491  0.572385

In [65]:
lst = 'AA BB CC DD EE'.split()

In [66]:
df['Index'] = lst

In [67]:
df

          P         Q         R         S         T Index
A -0.394657 -0.341933  0.128516 -1.353116  0.403196    AA
B  0.863354  0.739741 -2.090525 -0.230988 -1.449106    BB
C  0.858418 -0.979273 -0.171517 -0.995512  0.691262    CC
D -1.758540 -0.640521 -1.616071 -2.218288  0.187600    DD
E  0.535287 -1.020185  1.214594  1.075491  0.572385    EE

In [68]:
df.set_index('Index')

              P         Q         R         S         T
Index
AA    -0.394657 -0.341933  0.128516 -1.353116  0.403196
BB     0.863354  0.739741 -2.090525 -0.230988 -1.449106
CC     0.858418 -0.979273 -0.171517 -0.995512  0.691262
DD    -1.758540 -0.640521 -1.616071 -2.218288  0.187600
EE     0.535287 -1.020185  1.214594  1.075491  0.572385

# Multi index using function

In [70]:
# index levels

outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [71]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [72]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index,columns = ['A','B'])

In [73]:
df

             A         B
G1 1  1.187025  1.404434
   2  0.571440 -0.344304
   3 -0.300505  0.536835
G2 1 -2.228494 -0.893754
   2  0.112238  1.640023
   3  0.565361 -1.681607

In [77]:
df.loc['G1'].loc[1:]

          A         B
1  1.187025  1.404434
2  0.571440 -0.344304
3 -0.300505  0.536835

In [78]:
df.loc['G2'].loc[1:]

          A         B
1 -2.228494 -0.893754
2  0.112238  1.640023
3  0.565361 -1.681607

In [79]:
df.index.names

FrozenList([None, None])

In [80]:
df.index.names = ['Group','Num']

In [83]:
df

                  A         B
Group Num
G1    1    1.187025  1.404434
      2    0.571440 -0.344304
      3   -0.300505  0.536835
G2    1   -2.228494 -0.893754
      2    0.112238  1.640023
      3    0.565361 -1.681607

In [84]:
df.xs(['G1',2])

C:\Users\dines\AppData\Local\Temp\ipykernel_23496\3186320982.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',2])

A    0.571440
B   -0.344304
Name: (G1, 2), dtype: float64

In [85]:
df.xs(1,level = 'Num')

              A         B
Group
G1     1.187025  1.404434
G2    -2.228494 -0.893754

# To find a Missing values and fillna values

In [86]:
import pandas as pd
import numpy as np

In [87]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [88]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [89]:
df.dropna()

     A    B  C
0  1.0  5.0  1

# access columns axis = 1

In [90]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

# Thresh using allow nan value to given number eg : thresh = 1

In [91]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [92]:
df.fillna(value = '***')

     A    B  C
0  1.0  5.0  1
1  2.0  ***  2
2  ***  ***  3

## If u want to change dataset means u compulsory use inplace = True

In [93]:
df['B'].fillna(value = df['C'].mean())

0    5.0
1    2.0
2    2.0
Name: B, dtype: float64

In [94]:
df['C'].mean()

2.0

In [95]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Groupby function using to find number avg in one function

In [96]:
data = {'Company':['Google','Google','FB','HCL','ZOHO','ZOHO'],
       'Person':['Dinesh','Sowdambika','Kavushika','Sumaiya','Ragul','Vignesh'],
       'Sales':[200,220,350,360,190,100]}

In [97]:
data

{'Company': ['Google', 'Google', 'FB', 'HCL', 'ZOHO', 'ZOHO'],
 'Person': ['Dinesh',
  'Sowdambika',
  'Kavushika',
  'Sumaiya',
  'Ragul',
  'Vignesh'],
 'Sales': [200, 220, 350, 360, 190, 100]}

In [98]:
df = pd.DataFrame(data)

In [99]:
df

  Company      Person  Sales
0  Google      Dinesh    200
1  Google  Sowdambika    220
2      FB   Kavushika    350
3     HCL     Sumaiya    360
4    ZOHO       Ragul    190
5    ZOHO     Vignesh    100

In [100]:
df.groupby('Company').mean()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [101]:
df.groupby('Company')

In [102]:
d = df.groupby('Company')

In [103]:
d.mean()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [104]:
df.groupby('Company').std()

             Sales
Company
FB             NaN
Google   14.142136
HCL            NaN
ZOHO     63.639610

In [105]:
df.groupby('Company').min()

            Person  Sales
Company
FB       Kavushika    350
Google      Dinesh    200
HCL        Sumaiya    360
ZOHO         Ragul    100

In [106]:
df.groupby('Company').max()

             Person  Sales
Company
FB        Kavushika    350
Google   Sowdambika    220
HCL         Sumaiya    360
ZOHO        Vignesh    190

In [107]:
df.groupby('Company').median()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [108]:
df.describe()

            Sales
count    6.000000
mean   236.666667
std    100.531919
min    100.000000
25%    192.500000
50%    210.000000
75%    317.500000
max    360.000000

In [109]:
df.groupby('Company').count()

         Person  Sales
Company
FB            1      1
Google        2      2
HCL           1      1
ZOHO          2      2

In [110]:
df.groupby('Company').sum()

         Sales
Company
FB         350
Google     420
HCL        360
ZOHO       290

In [111]:
df.groupby('Company').value_counts()

Company  Person      Sales
FB       Kavushika   350      1
Google   Dinesh      200      1
         Sowdambika  220      1
HCL      Sumaiya     360      1
ZOHO     Ragul       190      1
         Vignesh     100      1
dtype: int64

# Merging, Joining, and Concantenating

In [112]:
import pandas as pd

In [113]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [114]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [115]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [116]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [117]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [118]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## To join a two dataframe means we use[ concat key] for dataframe

In [119]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [120]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging Example DataFrames

In [121]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [122]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [123]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [124]:
pd.merge(left,right,how = 'inner',on ='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Or to show a more complicated example:

In [125]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [126]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [127]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [129]:
pd.merge(left,right,on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [130]:
pd.merge(left,right,how = 'outer',on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [131]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining

In [132]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [133]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [134]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [135]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [136]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [137]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [138]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [139]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [140]:
df['col2'].nunique()

3

In [141]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [142]:
df[df['col1'] == 2]

   col1  col2 col3
1     2   555  def

In [143]:
def sq(d):
    return d **2

In [144]:
df['col1'].apply(sq)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [145]:
df['col2'].apply(sq)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [146]:
df['col2'].sum()

2109

In [147]:
del df['col1']

In [148]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [149]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [150]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [151]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [152]:
df.sort_values(by = 'col2',inplace = True)

In [153]:
df

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [154]:
df.isna().sum()

col2    0
col3    0
dtype: int64

In [155]:
df.dropna()

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [156]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

### ** Filling in NaN values with something else: **

In [157]:
df.fillna('@@')

  col1   col2 col3
0  1.0     @@  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   @@  444.0  xyz

In [158]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [159]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [160]:
df.pivot_table(values = 'D',index = ['A','B'],columns ='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and ouput

# CSV

In [162]:
df = pd.read_csv('Pandas/example.txt')

In [163]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [164]:
ls

 Volume in drive C is Local Disk
 Volume Serial Number is 90A7-8E7A

 Directory of C:\Users\dines\data science

04/11/2023  11:12 AM    <DIR>          .
04/10/2023  11:34 AM    <DIR>          ..
04/06/2023  02:01 PM    <DIR>          .ipynb_checkpoints
04/10/2023  11:07 AM    <DIR>          Data  visulaization
04/11/2023  11:12 AM           224,262 Explaination - Pandas.ipynb
04/11/2023  10:28 AM    <DIR>          Numpy
04/11/2023  10:27 AM    <DIR>          Pandas
               1 File(s)        224,262 bytes
               6 Dir(s)  123,979,001,856 bytes free

In [165]:
df.to_csv('example.txt',index=False)

In [166]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Excel

In [338]:
pd.read_excel('Excel_Sample.xlsx',sheet_name ='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15